Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicDescription
The Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicDescription struct describes the relevant properties of an Tekla.BIM.DirectManipulation.Services.Interaction.IHandleGraphic`1 instance.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicDescription.locationType
The location type.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicDescription.targetType
The target type.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicDescription.state
The state.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicDescription.customBitmap
Custom bitmap to be displayed

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicDescription.#ctor(Tekla.BIM.DirectManipulation.Services.Interaction.IHandleGraphic{Tekla.Common.Geometry.Vector3})
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicDescription struct.
handleGraphic: The instance to extract the properties from.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicDescription.#ctor(Tekla.BIM.DirectManipulation.Services.Interaction.IHandleTypeConfiguration,Tekla.BIM.DirectManipulation.Services.Interaction.InteractionState)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicDescription struct regardless of the type of IHandleGraphic{T}.
typeConfiguration: The properties specifying the full type of the handle.
interactionState: The handle's interaction state.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicDescription.CustomBitmap
Custom bitmap to be displayed.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicDescription.LocationType
Gets the location type.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicDescription.TargetType
Gets the target type.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicDescription.State
Gets the state.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicDescription.Equals(System.Object)
Indicates whether this instance and the specified other object are equal.
other: The other object to use.
Returns:
True if other and this instance are of the same type and represent the same value; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicDescription.GetHashCode
Returns the hash code for this instance.
Returns:
A 32-bit signed integer that is the hash code for this instance.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicDescription.ToString
Returns a System.String representation of the current instance.
Returns:
A System.String representation of the current instance.